/* написать класс Card, который хранит имя владельца банковской карты
и баланс счета на карте.От данного класса наследуйте CreditCard и 
DebitCard. CreditCard позволяют балансу уходить в минус(снять больше, чем на счету средств);
DebitCard не позволяет балансу быть отрицательным.
Bonus! -сделать поле баланса приватным(доступ и модификация осуществляется через соответствующие функции/методы).
-написать юнит-тесты (mocha+chai, jest, jasmine);
-для операций с балансом используйте обработку ошибок. */